Revit 2027 API
ExportLinetypeTable.Item Property
 A copy of the ExportLinetypeInfo for the linetype's ExportLinetypeKey.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ExportLinetypeInfo this[
	ExportLinetypeKey linetypeKey
] { get; set; }
Public Default Property Item (
	linetypeKey As ExportLinetypeKey
) As ExportLinetypeInfo
	Get
	Set
public:
virtual property ExportLinetypeInfo^ default[ExportLinetypeKey^ linetypeKey] {
	ExportLinetypeInfo^ get (ExportLinetypeKey^ linetypeKey) sealed;
	void set (ExportLinetypeKey^ linetypeKey, ExportLinetypeInfo^ value) sealed;
}
abstract Item : ExportLinetypeInfo with get, set
override Item : ExportLinetypeInfo with get, set
Parameters
linetypeKey ExportLinetypeKey
Return Value
ExportLinetypeInfo
 A copy of the ExportLinetypeInfo.
Exceptions
Exception | Condition
ArgumentException |  When getting this property: An entry with the given key is not present in the table.
Remarks
 When getting this property, it returns a copy of the ExportLinetypeInfo from the table. In order to make changes to the ExportLinetypeInfo and use those settings during export, set the modified ExportLinetypeInfo back into the table using the same key.
See Also
Reference
ExportLinetypeTable Class
Autodesk.Revit.DB Namespace